{
	"id": "hoh",
	"version": "6.0",
	"name": "Herrscher of Human: Ego",
	"type": "psychic",
	"valkyrie": "Elysia",
	"features": ["ice-dmg", "freeze", "time-mastery", "burst", "gather"],
	"weapon": "bow",
	"initialStar": "S",
	"leader": {
		"core": {
			"name": "Wandering Dream",
			"description": "Leader Bonus:\nLeader Skill: Increases every Ice DMG battlesuit's initial SP by 60.0pt.\nIn Open World, this effect triggered once every 10 minutes.\nIncreases the team's Ice DMG by 35.0%, and while Stars of the Past is in effect, increases the team's Ice DMG by another 20.0%."
		},
		"subskills": [
			{
				"name": "Wandering Dream",
				"description": "Increases every Ice DMG battlesuit's initial SP by #1[f1].\nIn Open World, this effect triggered once every 10 minutes.\nIncreases the team's Ice DMG by #2[f1]%, and while Stars of the Past is in effect, increases the team's Ice DMG by another #3[f1]%.",
				"maxLv": 2,
				"params": {
					"1": [55, 60],
					"2": [32, 35],
					"3": [15, 20]
				}
			}
		]
	},
	"passive": {
		"core": {
			"name": "Enlightened Salvation",
			"description": "Passive bonuses apply automatically.\nA balanced archer that has 2 shoot attempts.\nIf less than 2 shoot attempts remain, recover 1 attempt every 10s.\nBase Shooting Multiplier Correction: 100%\nAimed Base Shooting Multiplier Correction: 100%\n\nHerrscher of Human: Ego has two Herrscher Forms: Herrscher of Human Form and Herrscher of Origin Form. Cast Ultimate to switch between them.\nHer Charged ATK inflicts Pristine Seed stacks that last 15s and cap at 3. At 3 stacks, enemies enter Pristine Bloomage state for 2.5s. In Herrscher of Origin Form, Pristine Bloomage lasts for 3.5s and immobilizes enemies.\nHitting enemies in Pristine Bloomage state with weapon skill or special weapon skill triggers Ego Blossom. In Herrscher of Human Form, it deals 200% + 120% ATK of ICe DMG in an area. In Herrscher of Origin Form, it deals 500% ATK of Ice DMG. When Pristine Bloomage is removed, 1 Pristine Seed stack remains. Inflicting Pristine Seed again refreshes its duration."
		},
		"subskills": [
			{
				"name": "Finale's Glory",
				"description": "increases Ego Blossom's Total DMG by #1[f1]%.\nWHen Ego Blossom is triggered in Herrscher of Human form, it deals an extra #2[f1]% ATK of Ice DMG for each nearby enemy that is in Pristine Bloomage state. It registers 3 such enemies at most and cancels their Pristine Bloomage state.",
				"maxLv": 11,
				"params": {
					"1": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
					"2": [30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]
				}
			},
			{
				"name": "Unrestrained Abstinence",
				"description": "After using Ultimate Evasion Skill in Herrscher of Human form, increases Ice DMG by #1[f1]% for 5s. CD: 60s.\nExiting Herrscher of Origin form refreshes the CD.",
				"requiredRank": "sss",
				"maxLv": 11,
				"params": {
					"1": [20, 23, 26, 29, 32, 35, 38, 41, 44, 47, 50]
				}
			},
			{
				"name": "Illusory Haze",
				"description": "Enemies carrying Pristine Seed receive #1[f1]% ATK of Ice DMG every second.",
				"requiredRank": "s2",
				"maxLv": 11,
				"params": {
					"1": [20, 23, 26, 29, 32, 35, 38, 41, 44, 47, 50]
				}
			}
		]
	},
	"evasion": {
		"core": {
			"name": "Rising Starbeams",
			"description": "Quickly dodge enemy attacks up to twice in a row\n\nUltimate Evasion Skill:\nIn Herrscher of Human form, causes Global Time Fracture for 3s. Within 10s, the next Charged ATK shoots an enhanced pristine arrow that deals 400% + 2 x 100% ATK of Ice DMG and inflicts 3 Pristine Seed stacks. CD: 18s.\nIn Herrscher of Origin form, creates a starry vortex to pull enemies for 5s. CD: 18s."
		},
		"subskills": [
			{
				"name": "Timeless Evocation",
				"description": "When Herrscher of Human: Ego is off switch CD and a teammate consumes at least 100 SP in one go, her QTE is triggered. CD: 15s.",
				"maxLv": 1
			},
			{
				"name": "Moonlit Romance",
				"description": "Non-Ultimate Evasion can also trigger Ultimate Evasion Skill.",
				"maxLv": 1
			},
			{
				"name": "Thunderless Serenity",
				"description": "Reduces Ultimate Evasion Skill CD by #1[f1]s.\nIn Herrscher of Human Form, Charged ATK speed increases by #2[f1]% and triggering Ultimate Evasion Skill grants 2 Crystal Ice Mirror stacks.",
				"maxLv": 11,
				"params": {
					"1": [2.0, 2.2, 2.4, 2.6, 2.8, 3, 3.2, 3.4, 3.6, 3.8, 4.0],
					"2": [25.0, 27.5, 30.0, 32.5, 35.0, 37.5, 40.0, 42.5, 45.0, 47.5, 50.0]
				}
			}
		]
	},
	"special": {
		"core": {
			"name": "Charged ATK: Infinite Helix",
			"description": "Use a powerful attack that corresponds to the Herrscher Form.\nHerrscher of Human Form:\nHold [ATK] to create a crystal ballista. Once charging is complete, fire a pristine arrow that penerates every enemy along its trajectory, dealing 330% + 2 x 100% ATK of Ice DMG and inflicting 1 Pristine Seed stack. Hold [ATK] to fire consecutively, during which you can move.\nHerrscher of Origin Form:\nWhen Herrscher Charge is maxed, hold [ATK] to empty Herrscher Charge and summon Sprit of Origin to attack, dealing 700% ATK of Ice DMG. Hitting enemies resets Waltz of the Star's CD. This also creates a frost zone forward, adding 3 Pristine Seed stacks to all enemies in the zone. Frost zone lasts for 6s."
		},
		"subskills": [
			{
				"name": "Affectionate Gale",
				"description": "In Herrscher of Human form, increases Charged ATK's Total DMG by #1[f1]%.\nIn Herrscher of Origin form, increases Charged ATK's Total DMG by #2[f1]% and self's Total DMG by #3[f1]%.",
				"requiredRank": "ss",
				"maxLv": 11,
				"params": {
					"1": [12.0, 13.8, 15.6, 17.4, 19.2, 21.0, 22.8, 24.6, 26.4, 28.2, 30.0],
					"2": [20.0, 23.0, 26.0, 29.0, 32.0, 35.0, 38.0, 41.0, 44.0, 47.0, 50.0],
					"3": [5.0, 5.5, 6.0, 6.5, 7.0, 7.5, 8.0, 8.5, 9.0, 9.5, 10.0]
				}
			},
			{
				"name": "Gentle Warmth",
				"description": "In Herrscher of Human form, increases Elemental Breach by #1[f1]%.\nIn Herrscher of Origin form, increases Elemental Breach by #2[f1]% and reduces Total DMG received by #3[f1]%.",
				"maxLv": 11,
				"params": {
					"1": [5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10],
					"2": [12, 12.6, 13.2, 13.8, 14.4, 15, 15.6, 16.2, 16.8, 17.4, 18],
					"3": [25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]
				}
			},
			{
				"name": "Budding Innocence",
				"description": "On hitting an enemy carrying Pristine Seed, increases Total DMG by #1[f1]% and restores #2[f1] SP. SP recovery CD: 1s. When an enemy carrying Pristine Seed is defeated, restores #3[f1] HP, and grants 1 Crystal Ice Mirror stack in Herrscher of Human form.",
				"maxLv": 11,
				"params": {
					"1": [5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25],
					"2": [0.2, 0.28, 0.36, 0.44, 0.52, 0.6, 0.68, 0.76, 0.84, 0.92, 1.0],
					"3": [25.0, 27.5, 30.0, 32.5, 35.0, 37.5, 40.0, 42.5, 45.0, 47.5, 50.0]
				}
			}
		]
	},
	"ultimate": {
		"core": {
			"name": "Radiant Destiny",
			"description": "Switch between 2 Herrscher forms.\nOn casting Ultimate, enter Herrscher of Origin form, create Stars of the Past, deal 500% ATK of Ice DMG, and inflict Pristine Bloomage and 6 Rime Trauma. During which, all skill timers and the stage timer is paused.\nIn Herrscher of Origin form, she is also in burst mode and gains Herrscher Charge (Max: 400; Initial: 0). She regains herrscher Charge over time, regaining 80 per second within the first 5s and 60 per second after 5s. During which she fights with a staff instead a bow.\nTap [Weapon] to cast Waltz of the Stars, which deals a total of 500% ATK of Ice DMG on the first cast, and 1400% ATK of Ice DMG afterward. Exiting Herrscher of Origin form clears this effect. Waltz of the Stars CD: 20s (unaffected by CD reduction).\nWhen on the field in Herrscher of Origin form for over 5s, tap [ULT] again or wait until 17s to cast Finisher, dealing 1100% ATK of Ice DMG. During which, all skill timers and the stage timer is paused. In the meantime, if she is switched out, she will still cast Finisher, only dealing 100% ATK of Ice DMG. Casting Finisher ends Herrrscher of Origin form, activates Herrscher of Human form, and cancels Stars of the past.\nSP: 125, CD: 10s.\n\nWhile Stars of the Past is in effect, gain the following buffs:\nRestore 0.5 SP to every Ice DMG dealer every second.\nInflict 0.5 Rimte Trauma on very enemy every second.\nIce DMG ELF deals 50% more Ice DMG.\nIce DMG battlesuit deal an extra 5% DMG (an HP loss effect).\nEnemy receives an extra 100 x ATK of DMG (HP looss effect) on being frozen. This effect immediately applies to frozen enemies once when Stars of the Past is created.\nShe cannot be defeated in Herrscher of Origin form."
		},
		"subskills": [
			{
				"name": "Original Pristinity",
				"description": "Enemies carrying Pristine Seed or are in Pristine Bloomage state receive #1[f1]% more Total DMG from Herrscher of Human: Ego (cannot stack). She records teammates' SP consumption to gain 300 charges at most. In Herrscher of Origin Form, with over 0 charge, her Total DMG increases by #2[f1]%; With over 225 charges, her TOtal DMG increases by #3[f1]% for every charge over 225 charges. Exiting Herrscher of Origin form clears the charges.",
				"maxLevel": 6,
				"params": {
					"1": [10, 12, 14, 16, 18, 20],
					"2": [5, 6, 7, 8, 9, 10],
					"3": [0.2, 0.24, 0.28, 0.32, 0.36, 0.4]
				}
			},
			{
				"name": "Truly Elysia",
				"description": "Entering and exiting Herrscher of Origin Form cause Global Time Fracture for #1[f1]s and 1.0s respectively, and refresh Ultimate Evasion Skill CD once.",
				"maxLevel": 3,
				"params": {
					"1": [3, 4, 5]
				}
			},
			{
				"name": "Elysium Eternal",
				"description": "In Herrscher of Origin Form, Charged ATK deals an extra #1[f1]% ATK of Ice DMG. Every Charged ATK dealt increases Ultimate Finisher's additional ATK by #2[f1]% ATK of Ice DMG, up to 2 times. Exiting Herrscher of Origin Form clears all buff effects.",
				"maxLevel": 11,
				"params": {
					"1": [50, 65, 80, 95, 110, 125, 140, 155, 170, 185, 200],
					"2": [100, 130, 160, 190, 220, 250, 280, 310, 340, 370, 400]
				}
			}
		]
	},
	"basic": {
		"core": {
			"name": "Shattered Transience",
			"description": "Attack with a bow or staff.\n\nHerrscher of Human form: Use a bow to shoot arrows 4 times.\nSEQ 1: Deals 100% ATK of Ice DMG\nSEQ 2: Deals 2 x 60% ATK of Ice DMG\nSEQ 3: Deals 150% ATK of Ice DMG\nSEQ 4: Deals 200% ATK of Ice DMG\n\nHerrscher of Origin form: Use a staff to cast magic 4 times.\nSEQ 1: Deals 150% ATK of Ice DMG\nSEQ 2: Deals 8 x 40% ATK of Ice DMG\nSEQ 3: Deals 4 x 60% ATK of Ice DMG\nSEQ 4: Deals 200% ATK of Ice DMG, and then 200% ATK of Ice DMG gradually."
		},
		"subskills": [
			{
				"name": "Sparkling Hope",
				"description": "Deal #1[f1]% more Total DMG to MECH-type enemies.\nIn Herrscher of Human form, Basic ATK (Charged ATK excluded) grants 1 Crystal Ice Mirror stack on hit, up to a maximum of 4 stacks. Crystal Ice Mirror provides Iron Body, and reduces incoming DMG by #2[f1]% at the cost of 1 stack. If no stack is gained within 15s or Herrscher of Origin form is activated, lose all Crystal Ice Mirror stacks. A battlesuit carrying Crystal Ice Mirror passes it onto the battlesuit that replace her.",
				"maxLevel": 11,
				"params": {
					"1": [15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30],
					"2": [20, 23, 26, 29, 32, 35, 38, 41, 44, 47, 50]
				}
			},
			{
				"name": "Unstoppable Yearning",
				"description": "Increases Ice DMG by #1[f1]%.\nIn Herrscher of Origin form, increases Ice DMG by another #2[f1]%, and attacks deal additional #3[f1]% ATK of DMG.",
				"maxLevel": 11,
				"params": {
					"1": [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
					"2": [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
					"3": [10, 11.5, 13, 14.5, 16, 17.5, 19, 20.5, 22, 23.5, 25]
				}
			},
			{
				"name": "Golden Splendor",
				"description": "QTE: Triggered when in Herrscher of Human form and an enemy is Frozen or Time-Slowed. Inflicts Pristine Bloomage and deal #1[f1]% ATK of Ice DMG. If Ultimate Evasion Skill is not in CD, it is triggered. Within 20s of QTE entry, increases Total DMG by #2[f1]%. Triggering it again refreshes the duration.",
				"maxLevel": 11,
				"params": {
					"1": [500, 550, 600, 650, 700, 750, 800, 850, 900, 950, 1000],
					"2": [6, 6.9, 7.8, 8.7, 9.6, 10.5, 11.4, 12.3, 13.2, 14.1, 15]
				}
			}
		]
	}
}
